ci4/app/Models/MdlClient.php

SELECT COUNT(*) AS `numrows`
FROM `client`
WHERE `email` = 'asd'
AND `status` = 1
---
  function check_client_active($email){
    $db = \Config\Database::connect();
    $builder = $db->table('client');
    $builder->where(array('email' => $email , 'status' => 1 ) );
    $total = $builder->countAllResults();