ci4/app/Models/MdlOrder.php

public function getOrderDetailById($orderId)
    {
        return $this->db->table('order')
            ->select('order_list.id as id, product.id as product_id,order.id as order_id, order.kode, CONCAT(client.nama_depan, " ", client.nama_belakang) as client_name, product.nama as product_name, order_list.price, order_list.status')
            ->join('client', 'client.id = order.id_client')  // Join ke tabel client, gabung nama depan dan nama belakang
            ->join('order_list', 'order_list.id_order = order.id')  // Join ke tabel order_list
            ->join('product', 'product.id = order_list.id_product') // Join ke tabel product
            ->where('order.id', $orderId)
            ->get()
            ->getResultArray();
---
SELECT `order_list`.`id` as `id`, `product`.`id` as `product_id`, `order`.`id` as `order_id`, `order`.`kode`, CONCAT(client.nama_depan, " ", client.nama_belakang) as client_name, `product`.`nama` as `product_name`, `order_list`.`price`, `order_list`.`status`
FROM `order`
JOIN `client` ON `client`.`id` = `order`.`id_client`
JOIN `order_list` ON `order_list`.`id_order` = `order`.`id`
JOIN `product` ON `product`.`id` = `order_list`.`id_product`
WHERE `order`.`id` = '1'

    public function getOrderDetail($orderId)
{
    return $this->db->table('order')
        ->select('product.id as product_id,order.id as order_id, order.kode, CONCAT(client.nama_depan, " ", client.nama_belakang) as client_name, order.logo_tim, product.nama as product_name, product.picture, order_list.price, order_list.status')
        ->join('client', 'client.id = order.id_client')  // Join ke tabel client untuk mengambil nama klien
        ->join('order_list', 'order_list.id_order = order.id')  // Join ke tabel order_list untuk detail pesanan
        ->join('product', 'product.id = order_list.id_product') // Join ke tabel product untuk mendapatkan informasi produk
        ->where('order.kode', $orderId)
        ->get()
        ->getResultArray();
---
SELECT `product`.`id` as `product_id`, `order`.`id` as `order_id`, `order`.`kode`, CONCAT(client.nama_depan, " ", client.nama_belakang) as client_name, `order`.`logo_tim`, `product`.`nama` as `product_name`, `product`.`picture`, `order_list`.`price`, `order_list`.`status`
FROM `order`
JOIN `client` ON `client`.`id` = `order`.`id_client`
JOIN `order_list` ON `order_list`.`id_order` = `order`.`id`
JOIN `product` ON `product`.`id` = `order_list`.`id_product`
WHERE `order`.`kode` = 'uq98szad7'