ci4/app/Models/MdlOrder.php

SELECT `product`.`picture` as `picture`, `product`.`nama` as `nama_product`, `product`.`id` as `product_id`, `order`.`id` as `order_id`, `order`.`kode`, CONCAT(client.nama_depan, " ", client.nama_belakang) as client_name, `product`.`nama` as `product_name`, `order_list`.`price`, `order_list`.`status`
FROM `order`
JOIN `client` ON `client`.`id` = `order`.`id_client`
JOIN `order_list` ON `order_list`.`id_order` = `order`.`id`
JOIN `product` ON `product`.`id` = `order_list`.`id_product`
WHERE `order`.`kode` = 'h5ibofhkg'
---
public function getOrderDetailById($orderId)
    {
        return $this->db->table('order')
            ->select('order.*, order_list.id as id, product.id as product_id,order.id as order_id, order.kode, CONCAT(client.nama_depan, " ", client.nama_belakang) as client_name, product.nama as product_name, order_list.price, order_list.status')
            ->join('client', 'client.id = order.id_client')  // Join ke tabel client, gabung nama depan dan nama belakang
            ->join('order_list', 'order_list.id_order = order.id')  // Join ke tabel order_list
            ->join('product', 'product.id = order_list.id_product') // Join ke tabel product
            ->where('order.id', $orderId)
            ->get()
            ->getResultArray();

SELECT *
FROM `order`
WHERE `kode` = 'h5ibofhkg'
 LIMIT 1
---
    public function getOrderWithPlayers($orderId)
    {
        return $this->where('kode', $orderId)->first();

SELECT COUNT(ordertable.id) as totalProductSelesai
FROM `order`
JOIN `ordertable` ON `order`.`kode` = `ordertable`.`id_order`
WHERE YEAR(order.created_at) = '2025-02-01 00:00:00'
AND `order`.`status` = 3
---
    public function getTotalProductProgress($year)
    {
        $builder = $this->db->table('order');
        $builder->select('COUNT(ordertable.id) as totalProductProgress');
        $builder->join('ordertable', 'order.kode = ordertable.id_order');
        $builder->where('YEAR(order.created_at)', $year);
        $builder->where('order.status !=', 3); // Bukan selesai
        $builder->where('order.status !=', 4); // Bukan batal
        $builder->where('order.status !=', 0); // Bukan tidak aktif
        return $builder->get()->getRow()->totalProductProgress;