ci4/app/Models/MdlOrderTable.php

SELECT `order_list`.`price` as `price`, `ordertable`.*, `ordertable`.`nama` as `nama_player`, `product`.*, `product`.`nama` as `nama_product`, `product`.`id` as `product_id`, `size`.`kategori` as `size_category`, `size`.`ukuran` as `size_value`
FROM `ordertable`
LEFT JOIN `product` ON `ordertable`.`id_product` = `product`.`id`
LEFT JOIN `size` ON `size`.`id` = `ordertable`.`id_size`
LEFT JOIN `order_list` ON `order_list`.`id_product` = `product`.`id`
LEFT JOIN `order` ON `order_list`.`id_order` = `order`.`id`
WHERE `order`.`kode` = 'h5ibofhkg'
ORDER BY `ordertable`.`id_product` ASC, `ordertable`.`keterangan` ASC, `size`.`kategori` ASC, `size`.`ukuran` ASC, `ordertable`.`nomor_punggung` ASC
---
       public function getPlayersByOrderId($orderId)
{
    $builder = $this->db->table('ordertable');
    $builder->select('order_list.price as price,
        ordertable.*,ordertable.nama as nama_player,
        product.*,product.nama as nama_product ,product.id as product_id,
        size.kategori as size_category,
        size.ukuran as size_value
    ');

    $builder->join('product', 'ordertable.id_product = product.id', 'left'); // Join ke tabel product
    $builder->join('size', 'size.id = ordertable.id_size', 'left'); // Join ke tabel size
    $builder->join('order_list', 'order_list.id_product = product.id', 'left'); // Join ke tabel size
    $builder->join('order', 'order_list.id_order = order.id', 'left'); // Join ke tabel size

    $builder->where('order.kode', $orderId);
    // $builder->where('order_list.id_order', $orderId);

    // Tambahkan pengurutan sesuai role, size, dan nomor jersey
    $builder->orderBy('ordertable.id_product', 'ASC'); // Urutkan berdasarkan role
    $builder->orderBy('ordertable.keterangan', 'ASC'); // Urutkan berdasarkan role
    $builder->orderBy('size.kategori', 'ASC'); // Urutkan berdasarkan kategori size
    $builder->orderBy('size.ukuran', 'ASC'); // Urutkan berdasarkan ukuran
    $builder->orderBy('ordertable.nomor_punggung', 'ASC'); // Urutkan berdasarkan nomor punggung

    return $builder->get()->getResultArray();