ci4/app/Controllers/Client.php

 function getOrder(){
  $userInfo = $_SESSION['auth'];
  $mdl = new \App\Models\MdlOrder();
  return json_encode($mdl->where('id_client',$userInfo['id'])->findAll());
---
SELECT *
FROM `order`
WHERE `id_client` = '1'