ci4/app/Controllers/Home.php

  function getSlider(){
      $data = new \App\Models\MdlSlider();
      $data->where(array('status' =>1 ,'deleted_at'=>null ));
      return json_encode($data->get()->getResultArray());
---
SELECT *
FROM `slider`
WHERE `status` = 1
AND `deleted_at` IS NULL

    public function client($orderId){
     {
        $orderModel = new \App\Models\MdlOrderTable();
        $Mdl = new \App\Models\MdlOrder();
        $MdlSize = new \App\Models\MdlSize();


        // Ambil data order yang terkait dengan orderId
       // $orders = $orderModel->getOrdersWithParent($orderId);
        $orders = $orderModel->select('ordertable.id as id,ordertable.id_order,ordertable.id_product,ordertable.id_size,ordertable.nama,ordertable.ukuran,ordertable.nomor_punggung,ordertable.keterangan, product.judul,product.id_group,product.nama as nama_produk,product.picture,product.slug,product.text,order_list.price')
        ->join('product','product.id = ordertable.id_product')
        ->join('order_list','product.id = order_list.id_product')
                    ->where('ordertable.id_order',$orderId)
                    ->findAll();
        // var_dump($orders);
        // die();
        $pesanan = $Mdl->where('kode',$orderId)->find();
        $ukuran = $MdlSize->findAll();
---
SELECT `ordertable`.`id` as `id`, `ordertable`.`id_order`, `ordertable`.`id_product`, `ordertable`.`id_size`, `ordertable`.`nama`, `ordertable`.`ukuran`, `ordertable`.`nomor_punggung`, `ordertable`.`keterangan`, `product`.`judul`, `product`.`id_group`, `product`.`nama` as `nama_produk`, `product`.`picture`, `product`.`slug`, `product`.`text`, `order_list`.`price`
FROM `ordertable`
JOIN `product` ON `product`.`id` = `ordertable`.`id_product`
JOIN `order_list` ON `product`.`id` = `order_list`.`id_product`
WHERE `ordertable`.`id_order` = 'uq98szad7'
SELECT *
FROM `order`
WHERE `kode` = 'uq98szad7'
SELECT *
FROM `size`