ci4/app/Controllers/Home.php

SELECT COUNT(*) AS `numrows`
FROM `product_umum`
WHERE `deleted_at` IS NULL
AND `product_umum`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `order`
WHERE `deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `client`
WHERE `deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `portfolio`
WHERE `deleted_at` IS NULL
AND `portfolio`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `testimonial`
WHERE `deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `slider`
WHERE `deleted_at` IS NULL
AND `slider`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `service`
WHERE `deleted_at` IS NULL
AND `service`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `gallery`
WHERE `deleted_at` IS NULL
AND `gallery`.`deleted_at` IS NULL
SELECT *
FROM `product_umum`
WHERE `deleted_at` IS NULL
AND `status` = 1
AND `product_umum`.`deleted_at` IS NULL
 LIMIT 4
SELECT *
FROM `testimonial`
WHERE `deleted_at` IS NULL
 LIMIT 3
SELECT *
FROM `gallery`
WHERE `deleted_at` IS NULL
AND `gallery`.`deleted_at` IS NULL
 LIMIT 6
---
    public function index()
    {
        // Get real statistics from database
        $productModel = new MdlProduct();
        $productUmumModel = new MdlProductUmum();
        $orderModel = new MdlOrder();
        $clientModel = new MdlClient();
        $portfolioModel = new MdlPortfolio();
        $testimonialModel = new MdlTestimonial();
        $sliderModel = new MdlSlider();
        $serviceModel = new MdlService();
        $galleryModel = new MdlGallery();

        $data['totalProducts'] = $productModel->where('product_type', 'portfolio')->where('deleted_at', null)->countAllResults();
        $data['totalResellerProducts'] = $productModel->where('product_type', 'reseller')->where('deleted_at', null)->where('status', 1)->countAllResults();
        $data['totalProductsUmum'] = $productUmumModel->where('deleted_at', null)->countAllResults();
        $data['totalOrders'] = $orderModel->where('deleted_at', null)->countAllResults();
        $data['totalProductsSold'] = $orderModel->getTotalProductsSold();
        $data['totalClients'] = $clientModel->where('deleted_at', null)->countAllResults();
        $data['totalPortfolios'] = $portfolioModel->where('deleted_at', null)->countAllResults();
        $data['totalTestimonials'] = $testimonialModel->where('deleted_at', null)->countAllResults();
        $data['totalSliders'] = $sliderModel->where('deleted_at', null)->countAllResults();
        $data['totalServices'] = $serviceModel->where('deleted_at', null)->countAllResults();
        $data['totalGalleries'] = $galleryModel->where('deleted_at', null)->countAllResults();

        // Get products for display
        $data['products'] = $productModel->where('product_type', 'portfolio')->where('deleted_at', null)->where('status', 1)->orderBy('created_at', 'DESC')->limit(4)->findAll();
        $data['productsUmum'] = $productUmumModel->where('deleted_at', null)->where('status', 1)->limit(4)->findAll();

        // Get testimonials
        $data['testimonials'] = $testimonialModel->where('deleted_at', null)->limit(3)->findAll();

        // Get galleries
        $data['galleries'] = $galleryModel->where('deleted_at', null)->limit(6)->findAll();