ci4/app/Controllers/Home.php

SELECT `ordertable`.`id` as `id`, `ordertable`.`id_order`, `ordertable`.`id_product`, `ordertable`.`id_size`, `ordertable`.`nama`, `ordertable`.`ukuran`, `ordertable`.`nomor_punggung`, `ordertable`.`keterangan`, `product`.`judul`, `product`.`id_group`, `product`.`nama` as `nama_produk`, `product`.`picture`, `product`.`slug`, `product`.`text`, `order_list`.`price`, `order`.`status` as `status_pembayaran`
FROM `ordertable`
JOIN `product` ON `product`.`id` = `ordertable`.`id_product`
JOIN `order_list` ON `product`.`id` = `order_list`.`id_product`
JOIN `order` ON `order`.`id` = `order_list`.`id_order`
WHERE `order`.`kode` = 'ssl4yykin'
---
    public function client($orderId){
     {
        $orderModel = new \App\Models\MdlOrderTable();
        $Mdl = new \App\Models\MdlOrder();
        $MdlSize = new \App\Models\MdlSize();


        // Ambil data order yang terkait dengan orderId
       // $orders = $orderModel->getOrdersWithParent($orderId);
        $orders = $orderModel->select('ordertable.id as id,ordertable.id_order,ordertable.id_product,ordertable.id_size,ordertable.nama,ordertable.ukuran,ordertable.nomor_punggung,ordertable.keterangan, product.judul,product.id_group,product.nama as nama_produk,product.picture,product.slug,product.text,order_list.price, order.status as status_pembayaran')
        ->join('product','product.id = ordertable.id_product')
        ->join('order_list','product.id = order_list.id_product')
        ->join('order','order.id = order_list.id_order')
                    ->where('order.kode',$orderId)
                    ->findAll();