ci4/app/Controllers/Login.php

      }
    //end login & sign up with google
    //view page login register
    if ($userModel->countAllResults() == 0) {
---
SELECT COUNT(*) AS `numrows`
FROM `user`

  function altlogin(){
    if ($_ENV['altLogin'] == "ok") {
    // Session()->destroy();
    $userModel = new \App\Models\MdlUser();
    $user = $userModel->first('*');
                $data_user = [
                  'id' => $user['id'],
                  'nama_depan'=> $user['nama_depan'],
                  'level'=> $user['level'],
                  'nama_belakang'=> $user['nama_belakang'],
                  'name'=> $user['nama_depan']." ".$user['nama_belakang'],
                  'email'=> $user['email'],
                  'picture'=> $user['profile_picture'],
                ];

                $userModel->where("email", $user['email']);
                $profile = $userModel->get()->getResultArray();
---
SELECT *
FROM `user`
 LIMIT 1
SELECT *
FROM `user`
WHERE `email` = 'suluharwani007@gmail.com'

  function altloginuser(){
    if ($_ENV['altLogin'] == "ok") {
    // Session()->destroy();
    $userModel = new \App\Models\MdlClient();
    $user = $userModel->first('*');
                $data_user = [
                  'id' => $user['id'],
                  'nama_depan'=> $user['nama_depan'],
                  'nama_belakang'=> $user['nama_belakang'],
                  'name'=> $user['nama_depan']." ".$user['nama_belakang'],
                  'email'=> $user['email'],
                  'picture'=> $user['profile_picture'],
                ];

                $userModel->where("email", $user['email']);
                $profile = $userModel->get()->getResultArray();
---
SELECT *
FROM `client`
 LIMIT 1
SELECT *
FROM `client`
WHERE `email` = 'asd'