ci4/app/Controllers/Order.php

    public function addPayment()
    {
        $paymentModel = new \App\Models\MdlPayment();
        $orderListModel = new \App\Models\MdlOrderList();
        $data = $this->request->getPost();

        // Check if a payment with the same id_order already exists
        $existingPayment = $paymentModel->where('id_order', $data['id_order'])->first();

        if ($existingPayment) {
            // If a payment with the same id_order already exists, set the price to 0
            $data['price'] = 0;
        } else {
            // Calculate the total price from the MdlOrderList table for the given id_order
            $totalPrice = $orderListModel->selectSum('price')->where('id_order', $data['id_order'])->first()['price'];

            if ($totalPrice === null) {
                return $this->response->setStatusCode(400)->setJSON(['message' => 'Tidak ada order dengan id_order ini']);
            }

            // Set the price in the data array
            $data['price'] = $totalPrice;
        }

        // Insert the payment data into the MdlPayment table
        if ($paymentModel->insert($data)) {
---
SELECT *
FROM `payment`
WHERE `id_order` = '9'
 LIMIT 1
INSERT INTO `payment` (`id_order`, `name`, `downpayment`, `completion`, `discount`, `status`, `price`, `created_at`, `updated_at`) VALUES ('9', '', '50000', '', '', '0', 0, '2025-02-03 17:12:18', '2025-02-03 17:12:18')

    public function paymentHistory()
    {
        $orderId = $this->request->getGet('id_order');
        $paymentModel = new \App\Models\MdlPayment();

        $payments = $paymentModel->where('id_order', $orderId)->findAll();
---
SELECT *
FROM `payment`
WHERE `id_order` = '9'

  public function getOrderData()
  {
      $startDate = $this->request->getPost('startDate');
      $endDate = $this->request->getPost('endDate');

      // Ensure the dates are in the correct format and include time
      $startDateFull = $startDate . ' 00:00:00';
      $endDateFull = $endDate . ' 23:59:59';

      $orderModel = new \App\Models\MdlOrder;
      $orderListModel = new \App\Models\MdlOrderList;
      $orderTable = new \App\Models\MdlOrderTable;

      // Query orders within the specified date range
      $orders = $orderModel->where('created_at >=', $startDateFull)
                           ->where('created_at <=', $endDateFull)
                           ->findAll();

      $totalOrder = $orderModel->where('created_at >=', $startDateFull)
                               ->where('created_at <=', $endDateFull)
                               ->countAllResults();

      $completedOrders = $orderModel->where('created_at >=', $startDateFull)
                                    ->where('created_at <=', $endDateFull)
                                    ->where('status', 3)
                                    ->countAllResults();

      $progressOrders = $orderModel->where('created_at >=', $startDateFull)
                                   ->where('created_at <=', $endDateFull)
                                   ->where('status !=', 3)
                                   ->where('status !=', 4)
                                   ->where('status !=', 0)
                                   ->countAllResults();
---
SELECT *
FROM `order`
WHERE `created_at` >= '2025-02-01 00:00:00'
AND `created_at` <= '2025-02-10 23:59:59'
SELECT COUNT(*) AS `numrows`
FROM `order`
WHERE `created_at` >= '2025-02-01 00:00:00'
AND `created_at` <= '2025-02-10 23:59:59'
SELECT COUNT(*) AS `numrows`
FROM `order`
WHERE `created_at` >= '2025-02-01 00:00:00'
AND `created_at` <= '2025-02-10 23:59:59'
AND `status` = 3
SELECT COUNT(*) AS `numrows`
FROM `order`
WHERE `created_at` >= '2025-02-01 00:00:00'
AND `created_at` <= '2025-02-10 23:59:59'
AND `status` != 3
AND `status` != 4
AND `status` != 0