ci4/app/Controllers/Portfolio.php

SELECT *
FROM `product`
WHERE `product_type` = 'portfolio'
AND `deleted_at` IS NULL
AND `status` = 1
AND   (
`nama` LIKE '%MD TRIP X SF%' ESCAPE '!'
OR  `judul` LIKE '%MD TRIP X SF%' ESCAPE '!'
 )
AND `product`.`deleted_at` IS NULL
ORDER BY `created_at` DESC
 LIMIT 16
SELECT COUNT(*) AS `numrows`
FROM `product`
WHERE `product_type` = 'portfolio'
AND `deleted_at` IS NULL
AND `status` = 1
AND   (
`nama` LIKE '%MD TRIP X SF%' ESCAPE '!'
OR  `judul` LIKE '%MD TRIP X SF%' ESCAPE '!'
 )
AND `product`.`deleted_at` IS NULL
---
    public function index()
    {
        $model = new MdlProduct();
        $search = trim((string) $this->request->getGet('search'));

        $model->where('product_type', 'portfolio')
            ->where('deleted_at', null)
            ->where('status', 1)
            ->orderBy('created_at', 'DESC');

        if ($search !== '') {
            $model->groupStart()->like('nama', $search)->orLike('judul', $search)->groupEnd();
        }

        $data = [
            'portfolioItems' => $model->paginate(16),
            'pager' => $model->pager,
            'search' => $search,
        ];